const data = {
  'code': 200,
  'message': '操作成功',
  'data': [{
    'id': '1277445869418840064',
    'remarks': '',
    'createBy': {
      'id': '1265907104158318592'
    },
    'createDate': '2020-06-29 11:36:44',
    'updateBy': {
      'id': '1265907104158318592'
    },
    'updateDate': '2020-06-29 11:36:44',
    'parentId': '',
    'parentName': '',
    'parentIds': '',
    'nodeLevel': 0,
    'name': '通信系统设备',
    'sort': 30,
    'children': [{
      'id': '1277445869418840065',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:44',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:44',
      'parentId': '1277445869418840064',
      'parentName': '',
      'parentIds': ',1277445869418840064,',
      'nodeLevel': 1,
      'name': '传输设备',
      'sort': 30,
      'children': [{
        'id': '1277445869418840066',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:44',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:44',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': 'SDH设备',
        'sort': 30,
        'children': [{
          'id': '1277445869418840067',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:44',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:44',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '控制单元',
          'sort': 30,
          'code': '51101',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '控制单元',
          'statusText': '启用'
        }, {
          'id': '1277445869418840068',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:44',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:44',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '电源盘',
          'sort': 30,
          'code': '51102',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '电源盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840069',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '时钟盘',
          'sort': 30,
          'code': '51103',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '时钟盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840070',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '服务通道盘及公务电话',
          'sort': 30,
          'code': '51104',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '服务通道盘及公务电话',
          'statusText': '启用'
        }, {
          'id': '1277445869418840071',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '21X2Mb/s支路盘 75ohm',
          'sort': 30,
          'code': '51105',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '21X2Mb/s支路盘 75ohm',
          'statusText': '启用'
        }, {
          'id': '1277445869418840072',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'S1.1光群路',
          'sort': 30,
          'code': '51106',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'S1.1光群路',
          'statusText': '启用'
        }, {
          'id': '1277445869418840073',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'L1.1光群路',
          'sort': 30,
          'code': '51107',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'L1.1光群路',
          'statusText': '启用'
        }, {
          'id': '1277445869418840074',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'L1.1光支路盘',
          'sort': 30,
          'code': '51108',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'L1.1光支路盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840075',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'L1.2光支路盘',
          'sort': 30,
          'code': '51109',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'L1.2光支路盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840076',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '全矩阵盘',
          'sort': 30,
          'code': '51110',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '全矩阵盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840077',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '21X2M接口模块',
          'sort': 30,
          'code': '51111',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '21X2M接口模块',
          'statusText': '启用'
        }, {
          'id': '1277445869418840078',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '辅助接口模块',
          'sort': 30,
          'code': '51112',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '辅助接口模块',
          'statusText': '启用'
        }, {
          'id': '1277445869418840079',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'L4.1光支路盘',
          'sort': 30,
          'code': '51113',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'L4.1光支路盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840080',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'L4.2光支路盘',
          'sort': 30,
          'code': '51114',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'L4.2光支路盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840081',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '以太网业务接入板',
          'sort': 30,
          'code': '51115',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '以太网业务接入板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840082',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'L-16.1光支路盘',
          'sort': 30,
          'code': '51116',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'L-16.1光支路盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840083',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'L-16.2光支路盘',
          'sort': 30,
          'code': '51117',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'L-16.2光支路盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840084',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '63X2M接口模块',
          'sort': 30,
          'code': '51118',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '63X2M接口模块',
          'statusText': '启用'
        }, {
          'id': '1277445869418840085',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '4XSTM-1光支路盘',
          'sort': 30,
          'code': '51119',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '4XSTM-1光支路盘',
          'statusText': '启用'
        }, {
          'id': '1277445869418840086',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840066',
          'parentName': '',
          'parentIds': ',1277445869418840066,1277445869418840065,1277445869418840064,',
          'nodeLevel': 3,
          'name': '光信号放大器',
          'sort': 30,
          'code': '51120',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '光信号放大器',
          'statusText': '启用'
        }],
        'code': '511',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'SDH设备',
        'statusText': '启用'
      }, {
        'id': '1277445869418840087',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': 'ODF配线架',
        'sort': 30,
        'code': '512',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'ODF配线架',
        'statusText': '启用'
      }, {
        'id': '1277445869418840088',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': 'DDF配线架',
        'sort': 30,
        'code': '513',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'DDF配线架',
        'statusText': '启用'
      }, {
        'id': '1277445869418840089',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': '网管计算机',
        'sort': 30,
        'code': '514',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '网管计算机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840090',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': '干线光缆',
        'sort': 30,
        'code': '515',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '干线光缆',
        'statusText': '启用'
      }, {
        'id': '1277445869418840091',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': '干线电缆',
        'sort': 30,
        'code': '516',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '干线电缆',
        'statusText': '启用'
      }, {
        'id': '1277445869418840092',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': '通信子管',
        'sort': 30,
        'code': '517',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '通信子管',
        'statusText': '启用'
      }, {
        'id': '1277445869418840093',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': '通信管道',
        'sort': 30,
        'code': '518',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '通信管道',
        'statusText': '启用'
      }, {
        'id': '1277445869418840094',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840065',
        'parentName': '',
        'parentIds': ',1277445869418840065,1277445869418840064,',
        'nodeLevel': 2,
        'name': '其它',
        'sort': 30,
        'code': '519',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '其它',
        'statusText': '启用'
      }],
      'code': '51',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '传输设备',
      'statusText': '启用'
    }, {
      'id': '1277445869418840095',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:45',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:45',
      'parentId': '1277445869418840064',
      'parentName': '',
      'parentIds': ',1277445869418840064,',
      'nodeLevel': 1,
      'name': '交换设备',
      'sort': 30,
      'children': [{
        'id': '1277445869418840096',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '程控交换机',
        'sort': 30,
        'children': [{
          'id': '1277445869418840097',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '双音频普通用户板  ',
          'sort': 30,
          'code': '52101',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '双音频普通用户板  ',
          'statusText': '启用'
        }, {
          'id': '1277445869418840098',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '数字用户板',
          'sort': 30,
          'code': '52102',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '数字用户板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840099',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '基群速率中继接口板',
          'sort': 30,
          'code': '52103',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '基群速率中继接口板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840100',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '维护/管理用串行数据接口',
          'sort': 30,
          'code': '52104',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '维护/管理用串行数据接口',
          'statusText': '启用'
        }, {
          'id': '1277445869418840101',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '单CPU及存储器',
          'sort': 30,
          'code': '52105',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '单CPU及存储器',
          'statusText': '启用'
        }, {
          'id': '1277445869418840102',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '电源分配单元',
          'sort': 30,
          'code': '52106',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '电源分配单元',
          'statusText': '启用'
        }, {
          'id': '1277445869418840103',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '2M数字中继板',
          'sort': 30,
          'code': '52107',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '2M数字中继板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840104',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '模拟中继板',
          'sort': 30,
          'code': '52108',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '模拟中继板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840105',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '语音信箱板',
          'sort': 30,
          'code': '52109',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '语音信箱板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840106',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '多频互控板',
          'sort': 30,
          'code': '52110',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '多频互控板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840107',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '双音频普通用户板',
          'sort': 30,
          'code': '52111',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '双音频普通用户板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840108',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '数字用户板',
          'sort': 30,
          'code': '52112',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '数字用户板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840109',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '数字中继接口板DTI',
          'sort': 30,
          'code': '52113',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '数字中继接口板DTI',
          'statusText': '启用'
        }, {
          'id': '1277445869418840110',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '多频互控板MFC',
          'sort': 30,
          'code': '52114',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '多频互控板MFC',
          'statusText': '启用'
        }, {
          'id': '1277445869418840111',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '双基群速率中继接口板',
          'sort': 30,
          'code': '52115',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '双基群速率中继接口板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840112',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'D通道接口板',
          'sort': 30,
          'code': '52116',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'D通道接口板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840113',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '维护/管理用串行数据接口板',
          'sort': 30,
          'code': '52117',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '维护/管理用串行数据接口板',
          'statusText': '启用'
        }, {
          'id': '1277445869418840114',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '双CPU及存储器',
          'sort': 30,
          'code': '52118',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '双CPU及存储器',
          'statusText': '启用'
        }, {
          'id': '1277445869418840115',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:45',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:45',
          'parentId': '1277445869418840096',
          'parentName': '',
          'parentIds': ',1277445869418840096,1277445869418840095,1277445869418840064,',
          'nodeLevel': 3,
          'name': '电源分配单元',
          'sort': 30,
          'code': '52119',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '电源分配单元',
          'statusText': '启用'
        }],
        'code': '521',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '程控交换机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840116',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '维护终端',
        'sort': 30,
        'code': '522',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '维护终端',
        'statusText': '启用'
      }, {
        'id': '1277445869418840117',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '磁带机',
        'sort': 30,
        'code': '523',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '磁带机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840118',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '帐单存储机',
        'sort': 30,
        'code': '524',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '帐单存储机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840119',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '远程维护Modem',
        'sort': 30,
        'code': '525',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '远程维护Modem',
        'statusText': '启用'
      }, {
        'id': '1277445869418840120',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '数字话机',
        'sort': 30,
        'code': '526',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '数字话机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840121',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '打印机',
        'sort': 30,
        'code': '527',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '打印机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840122',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '管理计算机',
        'sort': 30,
        'code': '528',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '管理计算机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840123',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:45',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:45',
        'parentId': '1277445869418840095',
        'parentName': '',
        'parentIds': ',1277445869418840095,1277445869418840064,',
        'nodeLevel': 2,
        'name': '其它',
        'sort': 30,
        'code': '529',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '其它',
        'statusText': '启用'
      }],
      'code': '52',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '交换设备',
      'statusText': '启用'
    }, {
      'id': '1277445869418840124',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:46',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:46',
      'parentId': '1277445869418840064',
      'parentName': '',
      'parentIds': ',1277445869418840064,',
      'nodeLevel': 1,
      'name': '接入网设备',
      'sort': 30,
      'children': [{
        'id': '1277445869418840125',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840124',
        'parentName': '',
        'parentIds': ',1277445869418840124,1277445869418840064,',
        'nodeLevel': 2,
        'name': '光环载波接入系统',
        'sort': 30,
        'children': [{
          'id': '1277445869418840126',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '机框CBA',
          'sort': 30,
          'code': '53101',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '机框CBA',
          'statusText': '启用'
        }, {
          'id': '1277445869418840127',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '主控单元板CPU',
          'sort': 30,
          'code': '53102',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '主控单元板CPU',
          'statusText': '启用'
        }, {
          'id': '1277445869418840128',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '局端电源板L-PSU',
          'sort': 30,
          'code': '53103',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '局端电源板L-PSU',
          'statusText': '启用'
        }, {
          'id': '1277445869418840129',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '远端电源板R-PSU',
          'sort': 30,
          'code': '53104',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '远端电源板R-PSU',
          'statusText': '启用'
        }, {
          'id': '1277445869418840130',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '光收发器FO-XCVR',
          'sort': 30,
          'code': '53105',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '光收发器FO-XCVR',
          'statusText': '启用'
        }, {
          'id': '1277445869418840131',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '2M收发器E1X-XCVR',
          'sort': 30,
          'code': '53106',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '2M收发器E1X-XCVR',
          'statusText': '启用'
        }, {
          'id': '1277445869418840132',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '2M接口板E1AX',
          'sort': 30,
          'code': '53107',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '2M接口板E1AX',
          'statusText': '启用'
        }, {
          'id': '1277445869418840133',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '局端用户板LI-POTS',
          'sort': 30,
          'code': '53108',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '局端用户板LI-POTS',
          'statusText': '启用'
        }, {
          'id': '1277445869418840134',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '远端用户板RI-POTS',
          'sort': 30,
          'code': '53109',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '远端用户板RI-POTS',
          'statusText': '启用'
        }, {
          'id': '1277445869418840135',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '低速数据板ADU',
          'sort': 30,
          'code': '53110',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '低速数据板ADU',
          'statusText': '启用'
        }, {
          'id': '1277445869418840136',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '主机框扩充单元ELC',
          'sort': 30,
          'code': '53111',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '主机框扩充单元ELC',
          'statusText': '启用'
        }, {
          'id': '1277445869418840137',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': '副机框扩充单元EBC',
          'sort': 30,
          'code': '53112',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '副机框扩充单元EBC',
          'statusText': '启用'
        }, {
          'id': '1277445869418840138',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840125',
          'parentName': '',
          'parentIds': ',1277445869418840125,1277445869418840124,1277445869418840064,',
          'nodeLevel': 3,
          'name': 'LAN接口板N*64K-E',
          'sort': 30,
          'code': '53113',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': 'LAN接口板N*64K-E',
          'statusText': '启用'
        }],
        'code': '531',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光环载波接入系统',
        'statusText': '启用'
      }, {
        'id': '1277445869418840139',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840124',
        'parentName': '',
        'parentIds': ',1277445869418840124,1277445869418840064,',
        'nodeLevel': 2,
        'name': '直流供电电源',
        'sort': 30,
        'code': '532',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '直流供电电源',
        'statusText': '启用'
      }, {
        'id': '1277445869418840140',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840124',
        'parentName': '',
        'parentIds': ',1277445869418840124,1277445869418840064,',
        'nodeLevel': 2,
        'name': '其它接入网系统设备',
        'sort': 30,
        'code': '533',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '其它接入网系统设备',
        'statusText': '启用'
      }],
      'code': '53',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '接入网设备',
      'statusText': '启用'
    }, {
      'id': '1277445869418840141',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:46',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:46',
      'parentId': '1277445869418840064',
      'parentName': '',
      'parentIds': ',1277445869418840064,',
      'nodeLevel': 1,
      'name': '紧急电话系统',
      'sort': 30,
      'children': [{
        'id': '1277445869418840142',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '集中控制器',
        'sort': 30,
        'code': '541',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '集中控制器',
        'statusText': '启用'
      }, {
        'id': '1277445869418840143',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '远供电源',
        'sort': 30,
        'code': '542',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '远供电源',
        'statusText': '启用'
      }, {
        'id': '1277445869418840144',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '中继放大器',
        'sort': 30,
        'code': '543',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '中继放大器',
        'statusText': '启用'
      }, {
        'id': '1277445869418840145',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '紧急电话主机',
        'sort': 30,
        'code': '544',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '紧急电话主机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840146',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '紧急电话副机',
        'sort': 30,
        'code': '545',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '紧急电话副机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840147',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': 'UPS电源 ',
        'sort': 30,
        'code': '546',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'UPS电源 ',
        'statusText': '启用'
      }, {
        'id': '1277445869418840148',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '打印机',
        'sort': 30,
        'code': '547',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '打印机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840149',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '管理计算机',
        'sort': 30,
        'code': '548',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '管理计算机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840150',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840141',
        'parentName': '',
        'parentIds': ',1277445869418840141,1277445869418840064,',
        'nodeLevel': 2,
        'name': '其它',
        'sort': 30,
        'code': '549',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '其它',
        'statusText': '启用'
      }],
      'code': '54',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '紧急电话系统',
      'statusText': '启用'
    }, {
      'id': '1277445869418840151',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:46',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:46',
      'parentId': '1277445869418840064',
      'parentName': '',
      'parentIds': ',1277445869418840064,',
      'nodeLevel': 1,
      'name': '对讲系统设备',
      'sort': 30,
      'children': [{
        'id': '1277445869418840152',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840151',
        'parentName': '',
        'parentIds': ',1277445869418840151,1277445869418840064,',
        'nodeLevel': 2,
        'name': '手持对讲机',
        'sort': 30,
        'code': '551',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '手持对讲机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840153',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840151',
        'parentName': '',
        'parentIds': ',1277445869418840151,1277445869418840064,',
        'nodeLevel': 2,
        'name': '车载移动台',
        'sort': 30,
        'code': '552',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '车载移动台',
        'statusText': '启用'
      }, {
        'id': '1277445869418840154',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840151',
        'parentName': '',
        'parentIds': ',1277445869418840151,1277445869418840064,',
        'nodeLevel': 2,
        'name': '高山接力台',
        'sort': 30,
        'code': '553',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '高山接力台',
        'statusText': '启用'
      }, {
        'id': '1277445869418840155',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840151',
        'parentName': '',
        'parentIds': ',1277445869418840151,1277445869418840064,',
        'nodeLevel': 2,
        'name': '高山转讯台',
        'sort': 30,
        'code': '554',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '高山转讯台',
        'statusText': '启用'
      }, {
        'id': '1277445869418840156',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840151',
        'parentName': '',
        'parentIds': ',1277445869418840151,1277445869418840064,',
        'nodeLevel': 2,
        'name': '固定台',
        'sort': 30,
        'code': '555',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '固定台',
        'statusText': '启用'
      }, {
        'id': '1277445869418840157',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840151',
        'parentName': '',
        'parentIds': ',1277445869418840151,1277445869418840064,',
        'nodeLevel': 2,
        'name': '发射铁塔',
        'sort': 30,
        'code': '556',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '发射铁塔',
        'statusText': '启用'
      }],
      'code': '55',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '对讲系统设备',
      'statusText': '启用'
    }, {
      'id': '1277445869418840158',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:46',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:46',
      'parentId': '1277445869418840064',
      'parentName': '',
      'parentIds': ',1277445869418840064,',
      'nodeLevel': 1,
      'name': '通信电源系统',
      'sort': 30,
      'children': [{
        'id': '1277445869418840159',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840158',
        'parentName': '',
        'parentIds': ',1277445869418840158,1277445869418840064,',
        'nodeLevel': 2,
        'name': '智能型电源设备',
        'sort': 30,
        'children': [{
          'id': '1277445869418840160',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840159',
          'parentName': '',
          'parentIds': ',1277445869418840159,1277445869418840158,1277445869418840064,',
          'nodeLevel': 3,
          'name': '远端配电柜',
          'sort': 30,
          'code': '56101',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '远端配电柜',
          'statusText': '启用'
        }, {
          'id': '1277445869418840161',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840159',
          'parentName': '',
          'parentIds': ',1277445869418840159,1277445869418840158,1277445869418840064,',
          'nodeLevel': 3,
          'name': '直流充电器48V/10A',
          'sort': 30,
          'code': '56102',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '直流充电器48V/10A',
          'statusText': '启用'
        }, {
          'id': '1277445869418840162',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840159',
          'parentName': '',
          'parentIds': ',1277445869418840159,1277445869418840158,1277445869418840064,',
          'nodeLevel': 3,
          'name': '机柜（含配件线料）',
          'sort': 30,
          'code': '56103',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '机柜（含配件线料）',
          'statusText': '启用'
        }, {
          'id': '1277445869418840163',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840159',
          'parentName': '',
          'parentIds': ',1277445869418840159,1277445869418840158,1277445869418840064,',
          'nodeLevel': 3,
          'name': '交流配电单元',
          'sort': 30,
          'code': '56104',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '交流配电单元',
          'statusText': '启用'
        }, {
          'id': '1277445869418840164',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840159',
          'parentName': '',
          'parentIds': ',1277445869418840159,1277445869418840158,1277445869418840064,',
          'nodeLevel': 3,
          'name': '直流配电单元',
          'sort': 30,
          'code': '56105',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '直流配电单元',
          'statusText': '启用'
        }, {
          'id': '1277445869418840165',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840159',
          'parentName': '',
          'parentIds': ',1277445869418840159,1277445869418840158,1277445869418840064,',
          'nodeLevel': 3,
          'name': '整流器单元',
          'sort': 30,
          'code': '56106',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '整流器单元',
          'statusText': '启用'
        }, {
          'id': '1277445869418840166',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:46',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:46',
          'parentId': '1277445869418840159',
          'parentName': '',
          'parentIds': ',1277445869418840159,1277445869418840158,1277445869418840064,',
          'nodeLevel': 3,
          'name': '主监控器单元',
          'sort': 30,
          'code': '56107',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '主监控器单元',
          'statusText': '启用'
        }],
        'code': '561',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '智能型电源设备',
        'statusText': '启用'
      }, {
        'id': '1277445869418840167',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840158',
        'parentName': '',
        'parentIds': ',1277445869418840158,1277445869418840064,',
        'nodeLevel': 2,
        'name': '电源网管',
        'sort': 30,
        'code': '562',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '电源网管',
        'statusText': '启用'
      }, {
        'id': '1277445869418840168',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840158',
        'parentName': '',
        'parentIds': ',1277445869418840158,1277445869418840064,',
        'nodeLevel': 2,
        'name': '普通电源设备',
        'sort': 30,
        'code': '563',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '普通电源设备',
        'statusText': '启用'
      }, {
        'id': '1277445869418840169',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840158',
        'parentName': '',
        'parentIds': ',1277445869418840158,1277445869418840064,',
        'nodeLevel': 2,
        'name': '打印机',
        'sort': 30,
        'code': '564',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '打印机',
        'statusText': '启用'
      }],
      'code': '56',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '通信电源系统',
      'statusText': '启用'
    }],
    'code': '5',
    'status': 1,
    'tenantId': '1249628559274672128',
    'title': '通信系统设备',
    'statusText': '启用'
  }, {
    'id': '1277445869418840170',
    'remarks': '',
    'createBy': {
      'id': '1265907104158318592'
    },
    'createDate': '2020-06-29 11:36:46',
    'updateBy': {
      'id': '1265907104158318592'
    },
    'updateDate': '2020-06-29 11:36:46',
    'parentId': '',
    'parentName': '',
    'parentIds': '',
    'nodeLevel': 0,
    'name': '收费系统设备',
    'sort': 30,
    'children': [{
      'id': '1277445869418840171',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:46',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:46',
      'parentId': '1277445869418840170',
      'parentName': '',
      'parentIds': ',1277445869418840170,',
      'nodeLevel': 1,
      'name': '计算机',
      'sort': 30,
      'children': [{
        'id': '1277445869418840172',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840171',
        'parentName': '',
        'parentIds': ',1277445869418840171,1277445869418840170,',
        'nodeLevel': 2,
        'name': '网络服务器',
        'sort': 30,
        'code': '611',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '网络服务器',
        'statusText': '启用'
      }, {
        'id': '1277445869418840173',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840171',
        'parentName': '',
        'parentIds': ',1277445869418840171,1277445869418840170,',
        'nodeLevel': 2,
        'name': '台式计算机',
        'sort': 30,
        'code': '612',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '台式计算机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840174',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840171',
        'parentName': '',
        'parentIds': ',1277445869418840171,1277445869418840170,',
        'nodeLevel': 2,
        'name': '显示器',
        'sort': 30,
        'code': '61201',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '显示器',
        'statusText': '启用'
      }, {
        'id': '1277445869418840175',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840171',
        'parentName': '',
        'parentIds': ',1277445869418840171,1277445869418840170,',
        'nodeLevel': 2,
        'name': '硬盘',
        'sort': 30,
        'code': '61202',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '硬盘',
        'statusText': '启用'
      }, {
        'id': '1277445869418840176',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840171',
        'parentName': '',
        'parentIds': ',1277445869418840171,1277445869418840170,',
        'nodeLevel': 2,
        'name': '手提式计算机',
        'sort': 30,
        'code': '613',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '手提式计算机',
        'statusText': '启用'
      }, {
        'id': '1277445869418840177',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:46',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:46',
        'parentId': '1277445869418840171',
        'parentName': '',
        'parentIds': ',1277445869418840171,1277445869418840170,',
        'nodeLevel': 2,
        'name': '车道控制机',
        'sort': 30,
        'code': '614',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '车道控制机',
        'statusText': '启用'
      }],
      'code': '61',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '计算机',
      'statusText': '启用'
    }, {
      'id': '1277445869418840178',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:46',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:46',
      'parentId': '1277445869418840170',
      'parentName': '',
      'parentIds': ',1277445869418840170,',
      'nodeLevel': 1,
      'name': '网络设备',
      'sort': 30,
      'children': [{
        'id': '1277445869418840179',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869418840178',
        'parentName': '',
        'parentIds': ',1277445869418840178,1277445869418840170,',
        'nodeLevel': 2,
        'name': '路由器',
        'sort': 30,
        'code': '621',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '路由器',
        'statusText': '启用'
      }, {
        'id': '1277445869418840180',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869418840178',
        'parentName': '',
        'parentIds': ',1277445869418840178,1277445869418840170,',
        'nodeLevel': 2,
        'name': '交换、集线器',
        'sort': 30,
        'code': '622',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '交换、集线器',
        'statusText': '启用'
      }, {
        'id': '1277445869418840181',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869418840178',
        'parentName': '',
        'parentIds': ',1277445869418840178,1277445869418840170,',
        'nodeLevel': 2,
        'name': '调制解调器',
        'sort': 30,
        'code': '623',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '调制解调器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034368',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869418840178',
        'parentName': '',
        'parentIds': ',1277445869418840178,1277445869418840170,',
        'nodeLevel': 2,
        'name': '网络数据光端机',
        'sort': 30,
        'code': '624',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '网络数据光端机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034369',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869418840178',
        'parentName': '',
        'parentIds': ',1277445869418840178,1277445869418840170,',
        'nodeLevel': 2,
        'name': '防火墙',
        'sort': 30,
        'code': '625',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '防火墙',
        'statusText': '启用'
      }],
      'code': '62',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '网络设备',
      'statusText': '启用'
    }, {
      'id': '1277445869423034370',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:47',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:47',
      'parentId': '1277445869418840170',
      'parentName': '',
      'parentIds': ',1277445869418840170,',
      'nodeLevel': 1,
      'name': '外设',
      'sort': 30,
      'children': [{
        'id': '1277445869423034371',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '光盘刻录机',
        'sort': 30,
        'code': '631',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光盘刻录机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034372',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '打印机',
        'sort': 30,
        'code': '632',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '打印机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034373',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': 'IC卡读写器',
        'sort': 30,
        'code': '633',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'IC卡读写器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034374',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '电动栏杆',
        'sort': 30,
        'children': [{
          'id': '1277445869423034375',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:47',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:47',
          'parentId': '1277445869423034374',
          'parentName': '',
          'parentIds': ',1277445869423034374,1277445869423034370,1277445869418840170,',
          'nodeLevel': 3,
          'name': '电动栏杆机MUB',
          'sort': 30,
          'code': '63401',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '电动栏杆机MUB',
          'statusText': '启用'
        }, {
          'id': '1277445869423034376',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:47',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:47',
          'parentId': '1277445869423034374',
          'parentName': '',
          'parentIds': ',1277445869423034374,1277445869423034370,1277445869418840170,',
          'nodeLevel': 3,
          'name': '电动栏杆机MID',
          'sort': 30,
          'code': '63402',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '电动栏杆机MID',
          'statusText': '启用'
        }],
        'code': '634',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '电动栏杆',
        'statusText': '启用'
      }, {
        'id': '1277445869423034377',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '金额显示器',
        'sort': 30,
        'code': '635',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '金额显示器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034378',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '交通灯具',
        'sort': 30,
        'code': '636',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '交通灯具',
        'statusText': '启用'
      }, {
        'id': '1277445869423034379',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '声光报警器',
        'sort': 30,
        'code': '637',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '声光报警器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034380',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': 'I/O驱动器/解码器',
        'sort': 30,
        'code': '638',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'I/O驱动器/解码器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034381',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '其它外设',
        'sort': 30,
        'code': '639',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '其它外设',
        'statusText': '启用'
      }, {
        'id': '1277445869423034382',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '硬盘箱/柜',
        'sort': 30,
        'code': '63A',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '硬盘箱/柜',
        'statusText': '启用'
      }, {
        'id': '1277445869423034383',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '磁盘阵列卡',
        'sort': 30,
        'code': '63B',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '磁盘阵列卡',
        'statusText': '启用'
      }, {
        'id': '1277445869423034384',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '轴重仪',
        'sort': 30,
        'children': [{
          'id': '1277445869423034385',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:47',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:47',
          'parentId': '1277445869423034384',
          'parentName': '',
          'parentIds': ',1277445869423034384,1277445869423034370,1277445869418840170,',
          'nodeLevel': 3,
          'name': '轴重仪控制器',
          'sort': 30,
          'code': '63C01',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '轴重仪控制器',
          'statusText': '启用'
        }, {
          'id': '1277445869423034386',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:47',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:47',
          'parentId': '1277445869423034384',
          'parentName': '',
          'parentIds': ',1277445869423034384,1277445869423034370,1277445869418840170,',
          'nodeLevel': 3,
          'name': '称重台',
          'sort': 30,
          'code': '63C02',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '称重台',
          'statusText': '启用'
        }, {
          'id': '1277445869423034387',
          'remarks': '',
          'createBy': {
            'id': '1265907104158318592'
          },
          'createDate': '2020-06-29 11:36:47',
          'updateBy': {
            'id': '1265907104158318592'
          },
          'updateDate': '2020-06-29 11:36:47',
          'parentId': '1277445869423034384',
          'parentName': '',
          'parentIds': ',1277445869423034384,1277445869423034370,1277445869418840170,',
          'nodeLevel': 3,
          'name': '称重传感器',
          'sort': 30,
          'code': '63C03',
          'status': 1,
          'tenantId': '1249628559274672128',
          'title': '称重传感器',
          'statusText': '启用'
        }],
        'code': '63C',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '轴重仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034388',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '车辆分离器',
        'sort': 30,
        'code': '63D',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '车辆分离器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034389',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '轮胎识别器',
        'sort': 30,
        'code': '63E',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '轮胎识别器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034390',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': 'LED窗口信息板',
        'sort': 30,
        'code': '63F',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'LED窗口信息板',
        'statusText': '启用'
      }, {
        'id': '1277445869423034391',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '整车式称重平台',
        'sort': 30,
        'code': '63H',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '整车式称重平台',
        'statusText': '启用'
      }, {
        'id': '1277445869423034392',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034370',
        'parentName': '',
        'parentIds': ',1277445869423034370,1277445869418840170,',
        'nodeLevel': 2,
        'name': '自动发卡机',
        'sort': 30,
        'code': '63I',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '自动发卡机',
        'statusText': '启用'
      }],
      'code': '63',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '外设',
      'statusText': '启用'
    }, {
      'id': '1277445869423034393',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:47',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:47',
      'parentId': '1277445869418840170',
      'parentName': '',
      'parentIds': ',1277445869418840170,',
      'nodeLevel': 1,
      'name': '电源',
      'sort': 30,
      'children': [{
        'id': '1277445869423034394',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034393',
        'parentName': '',
        'parentIds': ',1277445869423034393,1277445869418840170,',
        'nodeLevel': 2,
        'name': 'UPS电源设备',
        'sort': 30,
        'code': '641',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'UPS电源设备',
        'statusText': '启用'
      }, {
        'id': '1277445869423034395',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034393',
        'parentName': '',
        'parentIds': ',1277445869423034393,1277445869418840170,',
        'nodeLevel': 2,
        'name': '稳压直流电源',
        'sort': 30,
        'code': '643',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '稳压直流电源',
        'statusText': '启用'
      }],
      'code': '64',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '电源',
      'statusText': '启用'
    }, {
      'id': '1277445869423034396',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:47',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:47',
      'parentId': '1277445869418840170',
      'parentName': '',
      'parentIds': ',1277445869418840170,',
      'nodeLevel': 1,
      'name': '空调设备',
      'sort': 30,
      'children': [{
        'id': '1277445869423034397',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034396',
        'parentName': '',
        'parentIds': ',1277445869423034396,1277445869418840170,',
        'nodeLevel': 2,
        'name': '窗式',
        'sort': 30,
        'code': '651',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '窗式',
        'statusText': '启用'
      }, {
        'id': '1277445869423034398',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034396',
        'parentName': '',
        'parentIds': ',1277445869423034396,1277445869418840170,',
        'nodeLevel': 2,
        'name': '分体式',
        'sort': 30,
        'code': '652',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '分体式',
        'statusText': '启用'
      }, {
        'id': '1277445869423034399',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034396',
        'parentName': '',
        'parentIds': ',1277445869423034396,1277445869418840170,',
        'nodeLevel': 2,
        'name': '柜式',
        'sort': 30,
        'code': '653',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '柜式',
        'statusText': '启用'
      }],
      'code': '65',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '空调设备',
      'statusText': '启用'
    }, {
      'id': '1277445869423034400',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:47',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:47',
      'parentId': '1277445869418840170',
      'parentName': '',
      'parentIds': ',1277445869418840170,',
      'nodeLevel': 1,
      'name': '其他设备',
      'sort': 30,
      'children': [{
        'id': '1277445869423034401',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034400',
        'parentName': '',
        'parentIds': ',1277445869423034400,1277445869418840170,',
        'nodeLevel': 2,
        'name': '手动栏杆',
        'sort': 30,
        'code': '661',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '手动栏杆',
        'statusText': '启用'
      }],
      'code': '66',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '其他设备',
      'statusText': '启用'
    }],
    'code': '6',
    'status': 1,
    'tenantId': '1249628559274672128',
    'title': '收费系统设备',
    'statusText': '启用'
  }, {
    'id': '1277445869423034402',
    'remarks': '',
    'createBy': {
      'id': '1265907104158318592'
    },
    'createDate': '2020-06-29 11:36:47',
    'updateBy': {
      'id': '1265907104158318592'
    },
    'updateDate': '2020-06-29 11:36:47',
    'parentId': '',
    'parentName': '',
    'parentIds': '',
    'nodeLevel': 0,
    'name': '监控系统设备',
    'sort': 30,
    'children': [{
      'id': '1277445869423034403',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:47',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:47',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '视频设备',
      'sort': 30,
      'children': [{
        'id': '1277445869423034404',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '摄像机',
        'sort': 30,
        'code': '711',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '摄像机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034405',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '彩色监视器',
        'sort': 30,
        'code': '712',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '彩色监视器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034406',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '视频切换器、矩阵',
        'sort': 30,
        'code': '713',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '视频切换器、矩阵',
        'statusText': '启用'
      }, {
        'id': '1277445869423034407',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '多画面分割器',
        'sort': 30,
        'code': '714',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '多画面分割器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034408',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '录像机',
        'sort': 30,
        'code': '715',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '录像机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034409',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '字符叠加器',
        'sort': 30,
        'code': '716',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '字符叠加器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034410',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '黑白监视器',
        'sort': 30,
        'code': '717',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '黑白监视器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034411',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '投影仪',
        'sort': 30,
        'code': '718',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '投影仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034412',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '其它视频设备',
        'sort': 30,
        'code': '719',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '其它视频设备',
        'statusText': '启用'
      }, {
        'id': '1277445869423034413',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:47',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:47',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '视/音频分配器',
        'sort': 30,
        'code': '71A',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '视/音频分配器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034414',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '等离子显示屏',
        'sort': 30,
        'code': '71B',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '等离子显示屏',
        'statusText': '启用'
      }, {
        'id': '1277445869423034415',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '显示单元',
        'sort': 30,
        'code': '71C',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '显示单元',
        'statusText': '启用'
      }, {
        'id': '1277445869423034416',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034403',
        'parentName': '',
        'parentIds': ',1277445869423034403,1277445869423034402,',
        'nodeLevel': 2,
        'name': '车牌识别仪',
        'sort': 30,
        'code': '71D',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '车牌识别仪',
        'statusText': '启用'
      }],
      'code': '71',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '视频设备',
      'statusText': '启用'
    }, {
      'id': '1277445869423034417',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:48',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:48',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '音频设备',
      'sort': 30,
      'children': [{
        'id': '1277445869423034418',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034417',
        'parentName': '',
        'parentIds': ',1277445869423034417,1277445869423034402,',
        'nodeLevel': 2,
        'name': '音频切换器',
        'sort': 30,
        'code': '721',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '音频切换器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034419',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034417',
        'parentName': '',
        'parentIds': ',1277445869423034417,1277445869423034402,',
        'nodeLevel': 2,
        'name': '微音监听器',
        'sort': 30,
        'code': '722',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '微音监听器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034420',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034417',
        'parentName': '',
        'parentIds': ',1277445869423034417,1277445869423034402,',
        'nodeLevel': 2,
        'name': '有线对讲主机',
        'sort': 30,
        'code': '723',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '有线对讲主机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034421',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034417',
        'parentName': '',
        'parentIds': ',1277445869423034417,1277445869423034402,',
        'nodeLevel': 2,
        'name': 'IP对讲',
        'sort': 30,
        'code': '724',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': 'IP对讲',
        'statusText': '启用'
      }],
      'code': '72',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '音频设备',
      'statusText': '启用'
    }, {
      'id': '1277445869423034422',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:48',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:48',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '监控控制设备',
      'sort': 30,
      'children': [{
        'id': '1277445869423034423',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '多媒体计算机',
        'sort': 30,
        'code': '731',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '多媒体计算机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034424',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '监控主机',
        'sort': 30,
        'code': '732',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '监控主机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034425',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '报警主机',
        'sort': 30,
        'code': '733',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '报警主机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034426',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '解码器',
        'sort': 30,
        'code': '734',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '解码器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034427',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '云台',
        'sort': 30,
        'code': '735',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '云台',
        'statusText': '启用'
      }, {
        'id': '1277445869423034428',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '视频服务器',
        'sort': 30,
        'code': '736',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '视频服务器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034429',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '中心媒体服务器',
        'sort': 30,
        'code': '737',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '中心媒体服务器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034430',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '中心控制机/管理中心机',
        'sort': 30,
        'code': '738',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '中心控制机/管理中心机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034431',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '解码器',
        'sort': 30,
        'code': '739',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '解码器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034432',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '硬盘录像系统',
        'sort': 30,
        'code': '73A',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '硬盘录像系统',
        'statusText': '启用'
      }, {
        'id': '1277445869423034433',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '网络视频服务器',
        'sort': 30,
        'code': '73B',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '网络视频服务器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034434',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '网络视频录像机',
        'sort': 30,
        'code': '73C',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '网络视频录像机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034435',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '中心高清图像服务器',
        'sort': 30,
        'code': '73D',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '中心高清图像服务器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034436',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034422',
        'parentName': '',
        'parentIds': ',1277445869423034422,1277445869423034402,',
        'nodeLevel': 2,
        'name': '台式计算机',
        'sort': 30,
        'code': '73E',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '台式计算机',
        'statusText': '启用'
      }],
      'code': '73',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '监控控制设备',
      'statusText': '启用'
    }, {
      'id': '1277445869423034437',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:48',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:48',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '图像存储、传输设备',
      'sort': 30,
      'children': [{
        'id': '1277445869423034438',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034437',
        'parentName': '',
        'parentIds': ',1277445869423034437,1277445869423034402,',
        'nodeLevel': 2,
        'name': '      视、音频光端机',
        'sort': 30,
        'code': '741',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '      视、音频光端机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034439',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034437',
        'parentName': '',
        'parentIds': ',1277445869423034437,1277445869423034402,',
        'nodeLevel': 2,
        'name': '      2M视、音频编解码器',
        'sort': 30,
        'code': '742',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '      2M视、音频编解码器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034440',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034437',
        'parentName': '',
        'parentIds': ',1277445869423034437,1277445869423034402,',
        'nodeLevel': 2,
        'name': '      局端数字化光传输平台',
        'sort': 30,
        'code': '743',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '      局端数字化光传输平台',
        'statusText': '启用'
      }, {
        'id': '1277445869423034441',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034437',
        'parentName': '',
        'parentIds': ',1277445869423034437,1277445869423034402,',
        'nodeLevel': 2,
        'name': '      千兆远端接入设备',
        'sort': 30,
        'code': '744',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '      千兆远端接入设备',
        'statusText': '启用'
      }, {
        'id': '1277445869423034442',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034437',
        'parentName': '',
        'parentIds': ',1277445869423034437,1277445869423034402,',
        'nodeLevel': 2,
        'name': '      交换机',
        'sort': 30,
        'code': '745',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '      交换机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034443',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034437',
        'parentName': '',
        'parentIds': ',1277445869423034437,1277445869423034402,',
        'nodeLevel': 2,
        'name': '磁盘阵列',
        'sort': 30,
        'code': '746',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '磁盘阵列',
        'statusText': '启用'
      }],
      'code': '74',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '图像存储、传输设备',
      'statusText': '启用'
    }, {
      'id': '1277445869423034444',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:48',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:48',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '光通信专用仪器、工具',
      'sort': 30,
      'children': [{
        'id': '1277445869423034445',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034444',
        'parentName': '',
        'parentIds': ',1277445869423034444,1277445869423034402,',
        'nodeLevel': 2,
        'name': '光纤熔接机',
        'sort': 30,
        'code': '751',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光纤熔接机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034446',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034444',
        'parentName': '',
        'parentIds': ',1277445869423034444,1277445869423034402,',
        'nodeLevel': 2,
        'name': '光时域反射测试仪',
        'sort': 30,
        'code': '752',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光时域反射测试仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034447',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034444',
        'parentName': '',
        'parentIds': ',1277445869423034444,1277445869423034402,',
        'nodeLevel': 2,
        'name': '光功率计',
        'sort': 30,
        'code': '753',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光功率计',
        'statusText': '启用'
      }, {
        'id': '1277445869423034448',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034444',
        'parentName': '',
        'parentIds': ',1277445869423034444,1277445869423034402,',
        'nodeLevel': 2,
        'name': '光源',
        'sort': 30,
        'code': '754',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光源',
        'statusText': '启用'
      }, {
        'id': '1277445869423034449',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034444',
        'parentName': '',
        'parentIds': ',1277445869423034444,1277445869423034402,',
        'nodeLevel': 2,
        'name': '光电话',
        'sort': 30,
        'code': '755',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光电话',
        'statusText': '启用'
      }, {
        'id': '1277445869423034450',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034444',
        'parentName': '',
        'parentIds': ',1277445869423034444,1277445869423034402,',
        'nodeLevel': 2,
        'name': '光识别仪',
        'sort': 30,
        'code': '756',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光识别仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034451',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034444',
        'parentName': '',
        'parentIds': ',1277445869423034444,1277445869423034402,',
        'nodeLevel': 2,
        'name': '光缆工具箱',
        'sort': 30,
        'code': '757',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '光缆工具箱',
        'statusText': '启用'
      }],
      'code': '75',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '光通信专用仪器、工具',
      'statusText': '启用'
    }, {
      'id': '1277445869423034452',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:48',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:48',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '数据网络专用仪器、工具',
      'sort': 30,
      'children': [{
        'id': '1277445869423034453',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034452',
        'parentName': '',
        'parentIds': ',1277445869423034452,1277445869423034402,',
        'nodeLevel': 2,
        'name': '网络分析仪',
        'sort': 30,
        'code': '761',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '网络分析仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034454',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034452',
        'parentName': '',
        'parentIds': ',1277445869423034452,1277445869423034402,',
        'nodeLevel': 2,
        'name': '数据测试仪',
        'sort': 30,
        'code': '762',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '数据测试仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034455',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034452',
        'parentName': '',
        'parentIds': ',1277445869423034452,1277445869423034402,',
        'nodeLevel': 2,
        'name': '单片机仿真器',
        'sort': 30,
        'code': '763',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '单片机仿真器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034456',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034452',
        'parentName': '',
        'parentIds': ',1277445869423034452,1277445869423034402,',
        'nodeLevel': 2,
        'name': '编程器',
        'sort': 30,
        'code': '764',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '编程器',
        'statusText': '启用'
      }],
      'code': '76',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '数据网络专用仪器、工具',
      'statusText': '启用'
    }, {
      'id': '1277445869423034457',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:48',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:48',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '其他仪器、仪表',
      'sort': 30,
      'children': [{
        'id': '1277445869423034458',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034457',
        'parentName': '',
        'parentIds': ',1277445869423034457,1277445869423034402,',
        'nodeLevel': 2,
        'name': '示波器',
        'sort': 30,
        'code': '771',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '示波器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034459',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034457',
        'parentName': '',
        'parentIds': ',1277445869423034457,1277445869423034402,',
        'nodeLevel': 2,
        'name': '信号源',
        'sort': 30,
        'code': '772',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '信号源',
        'statusText': '启用'
      }, {
        'id': '1277445869423034460',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034457',
        'parentName': '',
        'parentIds': ',1277445869423034457,1277445869423034402,',
        'nodeLevel': 2,
        'name': '频率计',
        'sort': 30,
        'code': '773',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '频率计',
        'statusText': '启用'
      }, {
        'id': '1277445869423034461',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034457',
        'parentName': '',
        'parentIds': ',1277445869423034457,1277445869423034402,',
        'nodeLevel': 2,
        'name': '电缆测试仪',
        'sort': 30,
        'code': '774',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '电缆测试仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034462',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034457',
        'parentName': '',
        'parentIds': ',1277445869423034457,1277445869423034402,',
        'nodeLevel': 2,
        'name': '电池电导测试仪',
        'sort': 30,
        'code': '775',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '电池电导测试仪',
        'statusText': '启用'
      }],
      'code': '77',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '其他仪器、仪表',
      'statusText': '启用'
    }, {
      'id': '1277445869423034463',
      'remarks': '',
      'createBy': {
        'id': '1265907104158318592'
      },
      'createDate': '2020-06-29 11:36:48',
      'updateBy': {
        'id': '1265907104158318592'
      },
      'updateDate': '2020-06-29 11:36:48',
      'parentId': '1277445869423034402',
      'parentName': '',
      'parentIds': ',1277445869423034402,',
      'nodeLevel': 1,
      'name': '其他设备',
      'sort': 30,
      'children': [{
        'id': '1277445869423034464',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '电视墙',
        'sort': 30,
        'code': '781',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '电视墙',
        'statusText': '启用'
      }, {
        'id': '1277445869423034465',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '监控台',
        'sort': 30,
        'code': '782',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '监控台',
        'statusText': '启用'
      }, {
        'id': '1277445869423034466',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '报警器',
        'sort': 30,
        'code': '783',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '报警器',
        'statusText': '启用'
      }, {
        'id': '1277445869423034467',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '照片打印机',
        'sort': 30,
        'code': '784',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '照片打印机',
        'statusText': '启用'
      }, {
        'id': '1277445869423034468',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '数码照相机（机械照相机）',
        'sort': 30,
        'code': '785',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '数码照相机（机械照相机）',
        'statusText': '启用'
      }, {
        'id': '1277445869423034469',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '扫描仪',
        'sort': 30,
        'code': '786',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '扫描仪',
        'statusText': '启用'
      }, {
        'id': '1277445869423034470',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:48',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:48',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '设备机柜',
        'sort': 30,
        'code': '787',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '设备机柜',
        'statusText': '启用'
      }, {
        'id': '1277445869423034471',
        'remarks': '',
        'createBy': {
          'id': '1265907104158318592'
        },
        'createDate': '2020-06-29 11:36:49',
        'updateBy': {
          'id': '1265907104158318592'
        },
        'updateDate': '2020-06-29 11:36:49',
        'parentId': '1277445869423034463',
        'parentName': '',
        'parentIds': ',1277445869423034463,1277445869423034402,',
        'nodeLevel': 2,
        'name': '可变情报板/标志',
        'sort': 30,
        'code': '78A',
        'status': 1,
        'tenantId': '1249628559274672128',
        'title': '可变情报板/标志',
        'statusText': '启用'
      }],
      'code': '78',
      'status': 1,
      'tenantId': '1249628559274672128',
      'title': '其他设备',
      'statusText': '启用'
    }],
    'code': '7',
    'status': 1,
    'tenantId': '1249628559274672128',
    'title': '监控系统设备',
    'statusText': '启用'
  }, {
    'id': '1280027514625851392',
    'remarks': '',
    'createBy': {
      'id': '1254793145888014336'
    },
    'createDate': '2020-07-06 14:35:16',
    'updateBy': {
      'id': '1254793145888014336'
    },
    'updateDate': '2020-07-06 14:35:16',
    'parentId': '',
    'parentName': '',
    'parentIds': '',
    'nodeLevel': 0,
    'name': '其他',
    'sort': 30,
    'code': '00X',
    'status': 1,
    'tenantId': '1249628559274672128',
    'title': '其他',
    'statusText': '启用'
  }],
  'success': true
}

module.exports = data
