module.exports = {
  //贵州
  clearVersion: '1201.2102.1',
  logIndexTitle: '站级运营业务管理平台',
  title: '站级运营业务管理平台',
  logo: {type: 'img', /* img*/ src: '/img/logo_gz.png'},
  company: '贵州智通天下信息技术有限公司',
  hgCompany: '招商华软信息有限公司提供技术支持',
  password: {reg: /^(?!(\d)\1{5,})(?!((?:0(?=1)|1(?=2)|2(?=3)|3(?=4)|4(?=5)|5(?=6)|6(?=7)|7(?=8)|8(?=9)){5}\d))(?!((?:9(?=8)|8(?=7)|7(?=6)|6(?=5)|5(?=4)|4(?=3)|3(?=2)|2(?=1)|1(?=0)){5}\d))(?!123321)(\d{6,20})+$/, msg: '6-20位字母数字组合且不能为弱密码（例如123456,111111等等）', same: false},
  index: {url: ''},  //首页配置 url:  对应菜单的url 例如：'/personalCenter' ,如果没有首页，则给空串 ‘’
}
